/*
//Задача 1: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

Console.WriteLine("Input first number");
int numa = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input second number");
int numb = Convert.ToInt32(Console.ReadLine());
Console.WriteLine();
if (a > b)
{
    Console.WriteLine($"{numa} more {numb}");
}
else
{
    Console.WriteLine($"{numb} more {numa}");
}

*/

/*
//Задача 2: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

Console.WriteLine("Input first number");
int numa = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input first number");
int numb = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input first number");
int numc = Convert.ToInt32(Console.ReadLine());

int Max(int a, int b, int c)
{
    int max = a;
    if(b > max) max = b;
    if(c > max) max = c;
    return max;
}

int max = Max(numa, numb, numc);
Console.WriteLine("Maximum number " + max);

*/