/*
//Задача 1: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

Console.WriteLine("Input first number");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input second number");
int b = Convert.ToInt32(Console.ReadLine());
Console.WriteLine();
if (a > b)
{
    Console.WriteLine($"{a} more {b}");
}
else
{
    Console.WriteLine($"{b} more {a}");
}

*/